<template>
  <div class="service-agreement-box">
    <div class="title">寓盟管家平台服务协议</div>
    <div class="content">
      <div class="cont-item" style="text-indent: 28px;">
        本平台服务协议（包括但不限于本协议及隐私声明项下全部条款以及与本协议相关的通过平台发布或未来可能发布的各项规则，以下简称“本协议”）由您与平台服务商字节牛（武汉）信息技术有限公司共同签署，本协议对您与字节牛（武汉）信息技术有限公司均具有法律效力。
      </div>
      <div class="cont-item" style="text-indent: 28px;">
        您接受本协议前，应仔细阅读本协议的全部内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。您不同意接受本协议任意内容，或无法准确理解相关条款含义的，请勿接受本协议，您可通过平台客服渠道进行询问。
      </div>
      <div class="cont-item" style="text-indent: 28px;">
        您通过网络页面确认并接受本协议或以其他方式接受本协议、或实际使用本协议项下服务的，即视为已经完全阅读、理解并同意接受本协议的全部内容。
      </div>
      <div class="cont-tit">
        一、定义
      </div>
      <div class="cont-item">
        1.1寓盟管家平台：指由字节牛（武汉）信息技术有限公司提供技术服务的平台网站。
      </div>
      <div class="cont-item">
        1.2寓盟管家平台服务：字节牛（武汉）信息技术有限公司基于互联网向您提供的各项服务。
      </div>
      <div class="cont-item">
        1.3寓盟管家平台规则：包括所有平台已经发布及后续发布的全部规则、产品说明、公告等。
      </div>
      <div class="cont-tit">
        二、账户注册与使用
      </div>
      <div class="cont-item">
        2.1 用户资格
      </div>
      <div class="cont-item">
        您确认，您为符合法律规定的完全民事权利能力及民事行为能力、能够独立承担民事责任的自然人，或是合法开展经营活动或其他业务的法人或其他组织，有资格从事本协议项下之合作，并有能力履行本协议约定之义务并独立承担法律责任。
      </div>
      <div class="cont-item">
        2.2 账户说明
      </div>
      <div class="cont-item">
        您知悉，您应对您账户的所有活动、操作和行为结果（包括但不限于发布信息、披露信息等）负责。您认可其账户的所有活动及操作均为您的真实意思表示，并愿意接受并承担该等活动及操作导致的全部后果。
      </div>
      <div class="cont-item">
        2.3 注册信息管理
      </div>
      <div class="cont-item">
        2.3.1 您在使用平台服务时，应根据平台页面的提示准确完整地提供您的信息（包括您的姓名、联系电话、联系地址等）。您知悉，您应保持您提供信息的真实性及有效性。
      </div>
      <div class="cont-item">
        2.3.2您应及时更新您提供的信息，平台将依法不时对您信息进行检查核实，您应当配合提供最新、真实、完整、有效的信息。如您未及时提供信息或您提供的信息存在明显不实的，您将承担因此对您自身、他人及平台造成的全部损失与不利后果。
      </div>
      <div class="cont-item">
        2.4 您确认并授权平台可自行或委托合作第三方通过合法渠道查询或核实您的个人信息（法律、法规、监管政策禁止查询的除外）并有权保存、整理或加工查获的信息；授权平台自行或委托合作的第三方从合法保存有您的个人信息的第三方采集信息，并根据您向平台提供的信息进行对比分析判断，进而取得该等信息的验证结果，以及是否存在其他关联风险。
      </div>
      <div class="cont-item">
        2.5您的账户为您自行设置并由您保管，平台在任何时候均不会主动要求您提供您的账户密码。请您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开平台。账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，平台并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。
      </div>
      <div class="cont-item">
        2.6如您发现任何未经授权使用您账户登录平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知平台。您理解平台对您的任何请求采取行动均需要合理时间，且平台应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除平台存在法定过错外，平台不承担责任。
      </div>
      <div class="cont-item">
        2.7如您需修改您已注册的账号名称或密码、或您遗忘您的账号名或密码的，请严格按照平台的提示信息经过身份验证（手机或电子邮箱等）后操作，或者致电平台并经身份验证后，由平台为您修改。
      </div>
      <div class="cont-tit">
        三、平台服务及规范
      </div>
      <div class="cont-item">
        3.1您有权在满足特定条件后通过平台上享受房源展示、电子合同、在线交易等服务。更多服务内容可登录平台浏览。
      </div>
      <div class="cont-item">
        3.1.1您在满足特定条件后（包括的那不限于同意并签订《寓盟管家平台合作协》、《真房源（交易）保障服务协议》或类似协议并根据协议约定严格执行的），可通过平台录入您依法受托出租的房源、并通过平台发布该等房源招租信息。
      </div>
      <div class="cont-item">
        3.1.2您在满足特定条件后，可根据平台及平台合作的提供电子合同服务的第三方的指引，开通电子合同服务，通过网络数据交换的形式与第三方签订合同。
      </div>
      <div class="cont-item">
        3.1.3您在满足特定条件后，可使用平台及平台合作的银行及/或持有支付业务许可证的第三方提供的在线交易服务。
      </div>
      <div class="cont-item">
        3.2您应当确保您在及/或通过平台上发布的商品及/或服务均不涉及违反国家法律法规的内容，且不侵害平台及任何第三方合法权益（包括但不限于知识产权）。平台因您的原因遭受损失的，您需予以赔偿。您违反本条保证的，平台有权中止或终止向您提供产品/服务且无需承担违约责任。
      </div>
      <div class="cont-item">
        3.3平台需向您收取部分服务费用的，应以平台与您另行签订的《合作协议》或类似合同约定为准。如未来平台将调整收费标准或就其他增值服务向您收取合理费用，平台将采取合理途径并以足够合理的期限提前通知您。
      </div>
      <div class="cont-item">
        3.4平台依照法律规定履行基础保障义务，但对于下述原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更等情形，平台不承担相应的违约责任：
      </div>
      <div class="cont-item">
        （一）因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素；
      </div>
      <div class="cont-item">
        （二）因电力供应故障、通讯网络故障等公共服务因素或第三人因素；
      </div>
      <div class="cont-item">
        （三）在平台已尽善意管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素。
      </div>
      <div class="cont-tit">
        四、用户信息的保护及授权
      </div>
      <div class="cont-item">
        4.1平台非常重视您个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，在您使用平台提供的服务时，您同意平台按照隐私声明收集、存储、使用、披露和保护您的个人信息。
      </div>
      <div class="cont-item">
        4.2您声明并保证，您对您所发布的信息拥有相应、合法的权利。否则，平台可对您发布的信息依法或依本协议进行删除、屏蔽并要求您承担相应违约责任。
        您知悉并承诺，您所发布的信息应不包含以下内容：
      </div>
      <div class="cont-item">
        4.2.1违反国家法律法规禁止性规定的；
      </div>
      <div class="cont-item">
        4.2.2政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
      </div>
      <div class="cont-item">
        4.2.3欺诈、虚假、不准确或存在误导性的；
      </div>
      <div class="cont-item">
        4.2.4侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；
      </div>
      <div class="cont-item">
        4.2.5侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；
      </div>
      <div class="cont-item">
        4.2.6存在可能破坏、篡改、删除、影响平台任何系统正常运行或未经授权秘密获取平台及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；
      </div>
      <div class="cont-item">
        4.2.7其他违背社会公共利益或公共道德或依据相关平台协议、规则的规定不适合在平台上发布的。
      </div>
      <div class="cont-item">
        4.3对于您提供、发布及在使用平台服务中形成的除个人信息外的文字、图片、视频、音频等非个人信息，在法律规定的保护期限内授权平台及其关联公司获得许可使用权利及再授权给其他第三方使用的权利。您同意平台及其关联公司存储、使用、复制、修订、编辑、发布、展示、翻译、分发您的非个人信息或制作其派生作品，或以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。
      </div>
      <div class="cont-item">
        4.4您知悉，为方便您使用第三方平台等其他相关服务，您授权平台将您在账户注册和使用平台服务过程中提供、形成的信息传递给第三方平台及其他相关服务提供者，或从第三方平台及其他相关服务提供者获取您在注册、使用相关服务期间提供、形成的信息。
      </div>
      <div class="cont-tit">
        五、违约及处理
      </div>
      <div class="cont-item">
        5.1 发生如下情形之一的，视为您违约：
      </div>
      <div class="cont-item">
        5.1.1使用平台服务时违反有关法律法规规定的；
      </div>
      <div class="cont-item">
        5.1.2违反本协议或其他与平台之间的协议约定的。
      </div>
      <div class="cont-item">
        5.2您在平台及/或通过平台发布的信息构成违约的，平台可根据相应规则立即对相应信息进行删除、屏蔽处理。如您严重违约（包括但不限于您涉嫌发布违法信息的、多次发布本协议约定不可包含的信息内容等情形），平台可查封您的账户并终止向您提供服务。
      </div>
      <div class="cont-item">
        5.3如您的行为使平台及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿平台及/或其关联公司的上述全部损失。如您的行为使平台及/或其关联公司遭受第三人主张权利，平台及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。
      </div>
      <div class="cont-item">
        5.4如您向平台及/或其关联公司的雇员或顾问等提供实物、现金、现金等价物、劳务、旅游等价值明显超出正常商务洽谈范畴的利益，则可视为您存在商业贿赂行为。发生上述情形的，平台可立即终止与您的所有合作并向您收取违约金及/或赔偿金，该等金额以平台因您的贿赂行为而遭受的经济损失和商誉损失作为计算依据。
      </div>
      <div class="cont-item">
        5.5如您因严重违约导致平台终止本协议时，出于维护平台秩序目的，平台及/或其关联公司可对与您在其他协议项下的合作采取中止甚或终止协议的措施，并以本协议约定的方式通知您。
      </div>
      <div class="cont-tit">
        六、协议变更
      </div>
      <div class="cont-item">
        平台可根据国家法律法规变化及维护交易秩序需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过法定程序并以本协议约定方式通知您。
        如您不同意变更事项，您有权于变更事项确定的生效日前联系平台反馈意见。如您对已生效的变更事项仍不同意的，您应当于变更事项生效之日起停止使用平台服务；如您在变更事项生效后仍继续使用平台服务，则视为您同意已生效的变更事项。
      </div>
      <div class="cont-tit">
        七、 通知
      </div>
      <div class="cont-item">
        7.1您在注册成为平台用户，并接受平台服务时，您应该向平台提供真实有效的联系方式（包括您的联系电话、联系地址等），对于联系方式发生变更的，您应及时更新有关信息，并保持可被联系的状态。
      </div>
      <div class="cont-item">
        7.2 平台通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在平台公告，向您提供的联系电话发送手机短信，向您的账号发送系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。
      </div>
      <div class="cont-tit">
        八、 协议的终止
      </div>
      <div class="cont-item">
        8.1您有权通过以下任一方式终止本协议：
      </div>
      <div class="cont-item">
        8.1.1变更事项生效前您停止使用并明示不愿接受变更事项的；
      </div>
      <div class="cont-item">
        8.1.2您明示不愿继续使用平台服务，与平台解除本协议的。
      </div>
      <div class="cont-item">
        8.2以下情况发生时，平台可以本协议约定方式通知您终止本协议：
      </div>
      <div class="cont-item">
        8.2.1您违反本协议约定，平台依据违约条款终止本协议的；
      </div>
      <div class="cont-item">
        8.2.2您盗用他人账户、发布违禁信息、骗取他人财物、售假、扰乱市场秩序、采取不正当手段谋利等行为，平台依据平台规则对您的账户予以冻结及/或封停的；
      </div>
      <div class="cont-item">
        8.2.3除上述情形外，因您多次违反平台规则相关规定且情节严重，平台依据平台规则对您的账户予以冻结及/或封停的；
      </div>
      <div class="cont-item">
        8.2.4其它应当终止服务的情况。
      </div>
      <div class="cont-item">
        8.3本协议终止后，除法律有明确规定外，平台无需向您或您指定的第三方披露您账户中的任何信息。
      </div>
      <div class="cont-item">
        8.4本协议终止后，平台仍享有下列权利：
      </div>
      <div class="cont-item">
        8.4.1继续保存您留存于平台的各类信息；
      </div>
      <div class="cont-item">
        8.4.2对于您过往的违约行为，平台仍可依据本协议向您追究违约责任。
      </div>
      <div class="cont-tit">
        九、 法律适用、管辖与其他
      </div>
      <div class="cont-item">
        9.1本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例及/或行业惯例。
      </div>
      <div class="cont-item">
        9.2您因使用平台服务所产生及与平台服务有关的争议，由平台与您协商解决。协商不成时，任何一方均可向字节牛（武汉）信息技术有限公司所在地有管辖权的人民法院提起诉讼。
      </div>
      <div class="cont-item">
        9.3本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
      </div>
      <div class="cont-tit">
        隐私声明
      </div>
      <div class="cont-item">
        字节牛（武汉）信息技术有限公司（以下简称“平台”或“我们”）致力于尊重并保护用户的个人隐私，鉴于网络的特性，我们无可避免地需要某些信息才能为您提供您请求的服务，本隐私声明（以下简称“本声明”）将阐述我们对用户信息的收集、使用、保护和共享政策，我们建议您完整地阅读本声明。
      </div>
      <div class="cont-item">
        一旦您确认接受本声明，即表示您已经完全阅读、理解、同意接受本声明的全部条款。
      </div>
      <div class="cont-item">
        本声明适用平台提供的产品或服务，不适用于其他第三方向您提供的服务，也不适用于平台中另行独立设置隐私声明的产品或服务。
      </div>
      <div class="cont-item">
        随着平台服务范围的扩大，平台可随时更新隐私声明的内容，且毋须另行通知。更新后的隐私声明一旦在网页上公布即有效，并代替原来的隐私声明。欢迎您随时查看本声明，并向我们反馈您的意见。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500">一、</span>除非平台另行声明���平台内的所有产品、技术、软件、程序、数据及其他信息（包括文字、图标、图片、照片、音频、视频、图表、色彩组合、版面设计等）的所有权利（包括版权、商标权、专利权、商业秘密及其他相关权利）均归平台及/或其关联公司所有。未经平台及/或其关联公司许可，任何人不得以包括通过机器人、蜘蛛等程序或设备监视、复制、传播、展示、镜像、上载、下载等方式擅自使用平台内容。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500"> 二、</span>平台的各标识，以及平台的其他标识、徽记、产品和服务名称为平台及/或其关联公司所有，如您就有宣传、展示等任何使用需要，您应提前取得平台及/或其关联公司书面授权。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500">三、</span>我们尊重知识产权，反对并打击侵犯知识产权的行为。知识产权权利人若认为平台内容（包括但不限于平台用户发布的商品信息）侵犯其合法权益的，可以通过平台进行投诉，我们将在收到权利人合格通知后依据相应的法律法规以及平台规则及时处理。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500">四、</span>我们将通过您的IP地址来收集非个人化的信息，例如您的浏览器性质、操作系统种类、给您提供接入服务的ISP的域名等，以优化在您手机或计算机等屏幕上显示的页面。通过收集上述信息，我们进行客流量统计，从而改进网站的管理或服务。
        通常，您能在匿名的状态下访问平台并获取信息。当我们需要可用于标识您的个人身份或允许我们与您联系的信息时，我们会征求您的同意。当您在平台进行注册登记或使用我们及第三方合作商提供的各项服务时，您需要向我们提供您的个人信息，这些个人信息包括但不限于：
      </div>
      <div class="cont-item">
        个人识别信息：如姓名、性别、身份证号码、电子邮件地址，住址和电话号码等信息。
      </div>
      <div class="cont-item">
        个人背景：如年龄、出生日期、职业、教育程度、星座、收入状况、婚姻、家庭状况等。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500">五、</span>根据相关法律法规规定，平台将以下情形发生时收集及/或透露您的信息且无需征得您的授权同意：
      </div>
      <div class="cont-item">
        5.1与国家安全、国防安全有关的；
      </div>
      <div class="cont-item">
        5.2与公共安全、公共卫生、重大公共利益有关的；
      </div>
      <div class="cont-item">
        5.3与犯罪侦查、起诉、审判和判决执行等有关的；
      </div>
      <div class="cont-item">
        5.4出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
      </div>
      <div class="cont-item">
        5.5所收集的个人信息是您自行向社会公众公开的；
      </div>
      <div class="cont-item">
        5.6从合法公开披露的信息中收集个人信息，如合法的新闻报道、政府信息公开等渠道；
      </div>
      <div class="cont-item">
        5.7根据您的要求签订合同所必需，或为向您提供必须的产品或服务所必需的；
      </div>
      <div class="cont-item">
        5.8用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
      </div>
      <div class="cont-item">
        5.9为合法的新闻报道所必需的；
      </div>
      <div class="cont-item">
        5.10学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
      </div>
      <div class="cont-item">
        5.11严重违反本协议的导致平台主动与您解约的，平台将根据相关协议及规则通过网站公告或其他形式披露部分信息；
      </div>
      <div class="cont-item">
        5.12法律法规规定的其他情形。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500">六、</span>如我们停止运营平台，我们将及时停止继续收集您个人信息的活动，并将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500">七、</span>Cookie 和同类技术的使用
      </div>
      <div class="cont-item">
        7.1使用 Cookies 能帮助您实现您的联机体验的个性化，您可以接受或拒绝 Cookies，大多数 Web 浏览器会自动接受 Cookies，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookies。
      </div>
      <div class="cont-item">
        7.2在您未拒绝接受cookies的情况下，cookies将被发送到您的浏览器，并储存在您的计算机硬盘等。我们使用cookies储存您访问我们网站的相关数据，在您访问或再次访问我们的网站时,我们能识别您的身份，并通过分析数据为您提供更好更多的服务。Cookies不会跟踪个人信息。
      </div>
      <div class="cont-item">
        7.3当您注册平台时，平台亦会使用 Cookies。在这种情况下，平台会收集并存储有用信息，当您再次访问平台时，我们可辨认您的身份。来自平台的 Cookies 只能被平台读取。cookies能让您充分利用我们最优秀的特色服务，所以我们建议您将其设置为打开状态。
      </div>
      <div class="cont-item">
        如果您的浏览器被设置为拒绝 Cookie，您仍然能够访问平台大多数网页。
      </div>
      <div class="cont-item">
        7.4除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500">八、</span>个人信息安全
      </div>
      <div class="cont-item">
        8.1我们已采取符合业界标准、合理可行的安全防护措施保护您提供的个人信息安全，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。
      </div>
      <div class="cont-item">
        8.2我们有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。
      </div>
      <div class="cont-item">
        8.3我们会采取合理可行的措施，尽力避免收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
      </div>
      <div class="cont-item">
        8.4请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
      </div>
      <div class="cont-item">
        8.5在不幸发生个人信息安全事件后，我们将按照法律法规的要求向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
      </div>
      <div class="cont-item">
        <span style="font-weight: 500">九、</span>联系我们
      </div>
      <div class="cont-item">
        如果您对本隐私声明或平台的隐私保护措施以及您在使用过程中的问题有任何意见和建议，您可通过平台客服或其他网页标注的方式联系我们。
      </div>
    </div>
    <div class="footer cursor" @click="closeThis">我知道了</div>
  </div>
</template>

<script>
export default {
  name: 'serviceAgreement',
  components: {},
  props: {
  },
  data() {
    return {};
  },
  created() {
  },
  methods: {
    closeThis(){
      this.$emit('closeThis');
    },
  },
  watch: {
  }
};
</script>

<style lang="less" scoped>
.service-agreement-box {
  width: 100%;
  height: calc(100vh - 100px);
  .title{
    margin-bottom: 24px;
    color: #111111;
    font-size:22px;
    font-family:PingFangSC-Medium,PingFang SC;
    font-weight:500;
    text-align: center;
  }
  .content{
    height: calc(100vh - 210px);
    overflow: auto;
    padding:0 5px 0 5px;
    color: #111111;
    font-size: 14px;
    line-height: 20px;
    .cont-item{
      font-size: 14px;
      margin-top: 8px;
    }
    .cont-tit{
      margin-top: 20px;
      font-size: 14px;
      font-weight: 500;
    }
  }
  .footer{
    text-align: center;
    margin-top: 30px;
    color: #0A87F8;
    font-size: 18px;
  }
}
</style>

